a233a2/ESP8266_STM32_AccessSystem_v1.0/STM32_ESP8266_MainCode/HARDWARE/PWM/pwm.c
#include "stm32f10x.h"

int SB=0;

void PWM_Init(){
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_OCInitTypeDef TIM_OCInitStructure;
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
		
	TIM_InternalClockConfig (TIM2);
		
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period = 20000 - 1;  //ARR
	TIM_TimeBaseInitStructure.TIM_Prescaler = 72- 1;   //PSC
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter=0;
	TIM_TimeBaseInit (TIM2, &TIM_TimeBaseInitStructure);
		
	TIM_OCStructInit (&TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse=0;  //CCR
	TIM_OC2Init(TIM2,&TIM_OCInitStructure);

	TIM_Cmd (TIM2, ENABLE);
}

void Servo_SetAngle(int Angle)
{
    TIM_SetCompare2 (TIM2, (Angle / 180 * 2000 + 500));
}



